// Умножение на матрицу с использованием многомерных массивов

#include<stdio.h>

int main()
{
	int c1, c2, r1, r2, i, j, k, a[10][10], b[10][10], result[10][10];

	printf("Введите количество строк и колонок матрицы А: ");
	scanf("%d %d", &r1, &c1);
	printf("Введите количество строк и колонок матрицы Б: ");
	scanf("%d %d", &r2, &c2);

	while(c1 != r2)
	{
		printf("К-во колонок первой матрицы не равно к-ву строк второй матрицы!");
		printf("Введите количество строк и колонок матрицы А: ");
		scanf("%d %d", &r1, &c1);
		printf("Введите количество строк и колонок матрицы Б: ");
		scanf("%d %d", &r2, &c2);

	}
	
	printf("\nВведите элементы матрицы А: \n\n");
	for(i=0;i<r1;++i)
		for(j=0;j<c1;++j)
		{
			printf("Введите элемент а%d%d: ",i+1,j+1);
			scanf("%d", &a[i][j]);
		}

	printf("\nВведите элементы матрицы Б: \n\n");
	for(i=0;i<r2;++i)
		for(j=0;j<c2;++j)
		{
			printf("Введите элемент b%d%d: ",i+1,j+1);
			scanf("%d", &b[i][j]);
		}
	for(i=0;i<r2;++i)
		for(j=0;j<c2;++j)
		{
			result[i][j]= 0;
		}

	for(i=0;i<r1;++i)
		for(j=0;j<c2;++j)
			for(k=0;k<c1;++k)
			{
				result[i][j]+= a[i][k]*b[k][j];
			}

	for(i=0;i<r1;++i)
		for(j=0;j<c2;++j)
		{
			printf("%d	", result[i][j]);
			if(j ==c2-1)
				printf("\n\n");
		}
	return 0;
		
}
